<template>
  <div>
    <h1>性能测试</h1>
    <h2>方案介绍：</h2>
    <p>在线上环境进行压测，使用AnyMock替代依赖下游服务，可以屏蔽对下游服务的影响，同时，可以通过构造下游服务各种异常场景下，被压服务的稳定性，压出被压服务真实全面的性能数据。</p>
    <h2>案例分享</h2>
    <p><em>敬请期待</em></p>
    <h1>自动化测试</h1>
    <h2>方案介绍：</h2>
    <p>在依赖较多的线下自动化测试环境，使用AnyMock替代下游测试服务，可以最大保障自动化case运行的环境稳定性。</p>
    <h2>案例分享：</h2>
    <h3>场景1 - mock不稳定的下游服务</h3>
    <p>被测服务A依赖下游服务B的某个接口，B服务不稳定，或接口超时，或返回内容经常被人为修改，导致自动化case运行失败。在AnyMock平台上配置B的该接口，按自动化要求设置响应内容。
    修改A的服务调用，将请求B访问修改为请求AnyMock服务。</p>
    <h3>场景2 - 有上下文的业务mock</h3>
    <p>被测服务A的不同自动化case之间有数据和状态的关联需求，比如：支付自动化case
    - case1，下单：创建一个新的支付订单号
    - case2，支付：对case1的新订单进行支付
    - case3，查询：查询case3订单支付信息</p>
    <p>可以通过向redis中存/取数据，实现接口关联</p>
    <p><strong><em>更多案例敬请期待</em></strong></p>
  </div>
</template>
